In [ ]:
# Programmer : Srushti Garad
# College : Keystone School Of Engineering
# Class : TE (A)
# Roll No :  20

In [1]:
# pandas -> structured data analysis
import pandas as pd
# numpy -> array operations
import numpy as np

In [15]:
##### Array

In [16]:
num = np.array([10,20,44,60,30,55])

In [17]:
num

array([10, 20, 44, 60, 30, 55])

In [18]:
type(num)

numpy.ndarray

In [19]:
num.dtype

dtype('int32')

In [20]:
num = np.array([10,20,44,60,30,55],dtype=np.int16)

In [14]:
num.dtype

dtype('int16')

In [22]:
num[3]

60

In [23]:
##### Series

In [24]:
s=pd.Series([45,12,38,75,19])

In [25]:
s

0    45
1    12
2    38
3    75
4    19
dtype: int64

In [26]:
type(s)

pandas.core.series.Series

In [27]:
s.dtype

dtype('int64')

In [28]:
s.size

5

In [29]:
s.shape

(5,)

In [30]:
s=pd.Series([45,12,38,75,19],index=range(100,105))

In [31]:
s

100    45
101    12
102    38
103    75
104    19
dtype: int64

In [34]:
s[103]

75

In [35]:
##### Data Frame -> only one to contain 2D data , means tabular data

In [64]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['sruu','suyu','bubu','qin','shru'])
m = pd.Series([66.89,99.0,33.88,88.7,66.55])

In [65]:
df = pd.DataFrame({
    'roll':r,
    'name':n,
    'marks':m
})

In [66]:
df

   roll  name  marks
0     1  sruu  66.89
1     2  suyu  99.00
2     3  bubu  33.88
3     4   qin  88.70
4     5  shru  66.55

In [67]:
df.shape

(5, 3)

In [68]:
df.size

15

In [69]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [70]:
type(df)

pandas.core.frame.DataFrame

In [71]:
##### Structured Data Analysis

In [72]:
import os 
os.getcwd()

'C:\\Users\\SRUSHTI\\Desktop\\DS'

In [73]:
###### import the data

In [74]:
df = pd.read_csv('student.csv')

In [75]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [83]:
cols = ['A','B','C','D','E']

In [84]:
df1 = pd.read_csv('student1.csv' , names = cols)

In [85]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [88]:
df3 = pd.read_csv('student3.tsv')

In [ ]:
## tsv -> tab seprated values

###

In [91]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [92]:
df3 = pd.read_csv('student3.tsv',sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [95]:
## read from link

df2 = pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv')

In [96]:
df2

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [97]:
dfx = pd.read_excel('student.xlsx')

In [98]:
dfx

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [99]:
#### using the dataframe object attributes

In [100]:
df.shape

(10, 5)

In [101]:
df.size

50

In [102]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [103]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [104]:
# ndim -> number of dimension
df.ndim

2

In [105]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [111]:
# T -> Transpose (row <-> Column , exchange)
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [112]:
#### Functions of methods

In [108]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [113]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [114]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [116]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21